In [ ]:
import pandas as pd
import sqlite3

In [ ]:
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

In [ ]:
cnn = sqlite3.connect('SQL_Server_Trail.db')

In [ ]:
%load_ext sql

In [ ]:
%sql sqlite:///SQL_Server_Trail.db

In [ ]:
%%sql
CREATE TABLE tblDepartment3(
    DepartmentID INT,
    DepartmentName NVARCHAR (25),
    DepartmentHead NVARCHAR (20),
    PRIMARY KEY (DepartmentID)
)

 * sqlite:///SQL_Server_Trail.db
Done.

[]

In [ ]:
%%sql
INSERT INTO tblDepartment3 VALUES
(1, 'IT', 'Shimi'),
(2, 'HR', 'Roth'),
(3, 'Payroll', 'Itai'),
(4, 'Other Department', 'Simha')

 * sqlite:///SQL_Server_Trail.db
4 rows affected.

[]

In [ ]:
%%sql
Select *
from tblDepartment

 * sqlite:///SQL_Server_Trail.db
(sqlite3.OperationalError) no such table: tblDepartment
[SQL: Select *
from tblDepartment]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [ ]:
%%sql
CREATE TABLE tblemployee
(
employeeID INT PRIMARY KEY,
firstName VARCHAR (30),
lastName VARCHAR (30),
gender VARCHAR (10),
Email VARCHAR (50),
PhoneNumber VARCHAR (15),
salary INT,
city VARCHAR (20),
HireDate DATE,
DepartmentID INT,
CONSTRAINT FK_DepartmentID FOREIGN KEY (DepartmentID) REFERENCES tblDepartment (DepartmentID)
) ;

 * sqlite:///SQL_Server_Trail.db
Done.

[]

In [ ]:
%%sql
INSERT INTO tblemployee VALUES
(1,'Tomer', 'Itzhakov','Male', 'Tomerikoka@gmail.com', '0508554622', 11000, 'Jerusalem', '20011201',1),
(2,'Shira', 'Nevo','Female', 'Shira@gmail.com', '0508515542', 8000, 'Jerusalem', '20020615',4),
(3,'Ester', 'Hyut','Female', 'Ester@gmail.com', '0508575148', 10000, 'Jerusalem', '20120528',3),
(4,'Robin', 'Choen','Male', 'Robin@gmail.com', '0528542523', 7000, 'Tel-Aviv', '20120224',2),
(5,'Shlomi', 'Hai','Male', 'Shlomi@gmail.com', '0528456122', 10000, 'Tel-Aviv', '20081019',3),
(6,'David', 'Kepler','Male', 'David@gmail.com', '0558847365', 11000, 'Tel-Aviv', '20160515',1),
(7,'Dana', 'Tova','Female', 'Dana@gmail.com', '0556789322', 4000, 'Tel-Aviv', '20160202',2),
(8,'Idan', 'Haviv','Male', 'Idan@gmail.com', '0508752256', 10000, 'Haifa', '20170522',3),
(9,'Eti', 'Boblil','Female', 'Eti@gmail.com', '0505847665', 2000, 'Haifa', '20180614',4),
(10,'Esti', 'Karlibah','Female', 'Esti@gmail.com', '0504859998', 1000, 'Haifa', '20140713',2)

 * sqlite:///SQL_Server_Trail.db
10 rows affected.

[]

 #### Распечатать всю таблицу tblemployee

In [ ]:
%%sql
SELECT * FROM tblemployee

 * sqlite:///SQL_Server_Trail.db
Done.

[(1, 'Tomer', 'Itzhakov', 'Male', 'Tomerikoka@gmail.com', '0508554622', 11000, 'Jerusalem', 20011201, 1),
 (2, 'Shira', 'Nevo', 'Female', 'Shira@gmail.com', '0508515542', 8000, 'Jerusalem', 20020615, 4),
 (3, 'Ester', 'Hyut', 'Female', 'Ester@gmail.com', '0508575148', 10000, 'Jerusalem', 20120528, 3),
 (4, 'Robin', 'Choen', 'Male', 'Robin@gmail.com', '0528542523', 7000, 'Tel-Aviv', 20120224, 2),
 (5, 'Shlomi', 'Hai', 'Male', 'Shlomi@gmail.com', '0528456122', 10000, 'Tel-Aviv', 20081019, 3),
 (6, 'David', 'Kepler', 'Male', 'David@gmail.com', '0558847365', 11000, 'Tel-Aviv', 20160515, 1),
 (7, 'Dana', 'Tova', 'Female', 'Dana@gmail.com', '0556789322', 4000, 'Tel-Aviv', 20160202, 2),
 (8, 'Idan', 'Haviv', 'Male', 'Idan@gmail.com', '0508752256', 10000, 'Haifa', 20170522, 3),
 (9, 'Eti', 'Boblil', 'Female', 'Eti@gmail.com', '0505847665', 2000, 'Haifa', 20180614, 4),
 (10, 'Esti', 'Karlibah', 'Female', 'Esti@gmail.com', '0504859998', 1000, 'Haifa', 20140713, 2)]

In [ ]:
%%sql
SELECT * FROM tblDepartment

 * sqlite:///SQL_Server_Trail.db
Done.

[(1, 'IT', 'Shimi'),
 (2, 'HR', 'Roth'),
 (3, 'Payroll', 'Itai'),
 (4, 'Other Department', 'Simha')]

#### Выбрать всех женщин  из tblemployee. Показывать только имя, пол и номер телефона

In [ ]:
%%sql
SELECT firstName, gender, PhoneNumber FROM tblemployee
WHERE gender = 'Female'

 * sqlite:///SQL_Server_Trail.db
   sqlite:///The_SQL_Server_Trail_Database.db
   sqlite:///The_SQL_Server_Trail_Database2.db
   sqlite:///The_SQL_Server_Trail_Database3.db
Done.

[('Shira', 'Female', '0508515542'),
 ('Ester', 'Female', '0508575148'),
 ('Dana', 'Female', '0556789322'),
 ('Eti', 'Female', '0505847665'),
 ('Esti', 'Female', '0504859998')]

#### Выберите всех мужчин, которые живут в Иерусалиме и Хайфе.

in

In [ ]:
%%sql
SELECT * FROM tblemployee
WHERE gender = 'Male' AND city IN ('Jerusalem', 'Haifa')

 * sqlite:///The_SQL_Server_Trail_Database.db
Done.

[(1, 'Tomer', 'Itzhakov', 'Male', 'Tomerikoka@gmail.com', '0508554622', 11000, 'Jerusalem', 20011201, 1),
 (8, 'Idan', 'Haviv', 'Male', 'Idan@gmail.com', '0508752256', 10000, 'Haifa', 20170522, 3)]

с помощью логических условий

In [ ]:
%%sql
SELECT *
FROM tblemployee
WHERE gender=='Male' and (city=='Jerusalem' or city=='Haifa')

 * sqlite:///The_SQL_Server_Trail_Database.db
Done.

[(1, 'Tomer', 'Itzhakov', 'Male', 'Tomerikoka@gmail.com', '0508554622', 11000, 'Jerusalem', 20011201, 1),
 (8, 'Idan', 'Haviv', 'Male', 'Idan@gmail.com', '0508752256', 10000, 'Haifa', 20170522, 3)]

#### Выбрать всех сотрудников с зарплатой 6000 или 11000

or

In [ ]:
%%sql SELECT * FROM tblemployee
WHERE salary = 6000 or salary = 11000

 * sqlite:///The_SQL_Server_Trail_Database.db
Done.

[(1, 'Tomer', 'Itzhakov', 'Male', 'Tomerikoka@gmail.com', '0508554622', 11000, 'Jerusalem', 20011201, 1),
 (6, 'David', 'Kepler', 'Male', 'David@gmail.com', '0558847365', 11000, 'Tel-Aviv', 20160515, 1)]

in

In [ ]:
%%sql
SELECT *
FROM tblemployee
WHERE salary IN (6000, 11000)

 * sqlite:///The_SQL_Server_Trail_Database.db
Done.

[(1, 'Tomer', 'Itzhakov', 'Male', 'Tomerikoka@gmail.com', '0508554622', 11000, 'Jerusalem', 20011201, 1),
 (6, 'David', 'Kepler', 'Male', 'David@gmail.com', '0558847365', 11000, 'Tel-Aviv', 20160515, 1)]

#### Выберите всех сотрудников, которые живут в Иерусалиме и Хайфе с зарплатой от 4000 до 10000

In [ ]:
%%sql SELECT * FROM tblemployee
WHERE (salary >= 4000 and salary <= 10000) AND city IN ('Jerusalem', 'Haifa')

 * sqlite:///The_SQL_Server_Trail_Database.db
Done.

[(2, 'Shira', 'Nevo', 'Female', 'Shira@gmail.com', '0508515542', 8000, 'Jerusalem', 20020615, 4),
 (3, 'Ester', 'Hyut', 'Female', 'Ester@gmail.com', '0508575148', 10000, 'Jerusalem', 20120528, 3),
 (8, 'Idan', 'Haviv', 'Male', 'Idan@gmail.com', '0508752256', 10000, 'Haifa', 20170522, 3)]

In [ ]:
%%sql SELECT * FROM tblemployee
WHERE salary BETWEEN 4000 AND 10000
AND city IN ('Jerusalem', 'Haifa')

 * sqlite:///The_SQL_Server_Trail_Database.db
Done.

[(2, 'Shira', 'Nevo', 'Female', 'Shira@gmail.com', '0508515542', 8000, 'Jerusalem', 20020615, 4),
 (3, 'Ester', 'Hyut', 'Female', 'Ester@gmail.com', '0508575148', 10000, 'Jerusalem', 20120528, 3),
 (8, 'Idan', 'Haviv', 'Male', 'Idan@gmail.com', '0508752256', 10000, 'Haifa', 20170522, 3)]

#### Выбрать всех сотрудников с номером телефона, начинающимся с 050

In [ ]:
%%sql SELECT * FROM tblemployee
WHERE PhoneNumber like '050%'

 * sqlite:///The_SQL_Server_Trail_Database.db
Done.

[(1, 'Tomer', 'Itzhakov', 'Male', 'Tomerikoka@gmail.com', '0508554622', 11000, 'Jerusalem', 20011201, 1),
 (2, 'Shira', 'Nevo', 'Female', 'Shira@gmail.com', '0508515542', 8000, 'Jerusalem', 20020615, 4),
 (3, 'Ester', 'Hyut', 'Female', 'Ester@gmail.com', '0508575148', 10000, 'Jerusalem', 20120528, 3),
 (8, 'Idan', 'Haviv', 'Male', 'Idan@gmail.com', '0508752256', 10000, 'Haifa', 20170522, 3),
 (9, 'Eti', 'Boblil', 'Female', 'Eti@gmail.com', '0505847665', 2000, 'Haifa', 20180614, 4),
 (10, 'Esti', 'Karlibah', 'Female', 'Esti@gmail.com', '0504859998', 1000, 'Haifa', 20140713, 2)]

#### Выбрать всех сотрудников с номером телефона, не начинающимся с 050

In [ ]:
%%sql SELECT * FROM tblemployee
WHERE PhoneNumber NOT like '050%'

 * sqlite:///The_SQL_Server_Trail_Database.db
Done.

[(4, 'Robin', 'Choen', 'Male', 'Robin@gmail.com', '0528542523', 7000, 'Tel-Aviv', 20120224, 2),
 (5, 'Shlomi', 'Hai', 'Male', 'Shlomi@gmail.com', '0528456122', 10000, 'Tel-Aviv', 20081019, 3),
 (6, 'David', 'Kepler', 'Male', 'David@gmail.com', '0558847365', 11000, 'Tel-Aviv', 20160515, 1),
 (7, 'Dana', 'Tova', 'Female', 'Dana@gmail.com', '0556789322', 4000, 'Tel-Aviv', 20160202, 2)]

#### Выберите 5 строк со столбцами имени, зарплаты и города в порядке зарплаты (от максимальной зарплаты до минимальной зарплаты)

In [ ]:
%%sql
SELECT firstName, salary, city FROM tblemployee
ORDER BY salary DESC
LIMIT 5

 * sqlite:///The_SQL_Server_Trail_Database.db
Done.

[('Tomer', 11000, 'Jerusalem'),
 ('David', 11000, 'Tel-Aviv'),
 ('Ester', 10000, 'Jerusalem'),
 ('Shlomi', 10000, 'Tel-Aviv'),
 ('Idan', 10000, 'Haifa')]

###  Группировка по вопросам - используйте таблицу tblemployee

#### Показать среднюю зарплату по полу

In [ ]:
%%sql SELECT gender, AVG(salary) AS ['Средняя зарплата'] FROM tblemployee
GROUP BY gender

 * sqlite:///SQL_Server_Trail.db
Done.

[('Female', 5000.0), ('Male', 9800.0)]

In [ ]:
%%sql
SELECT gender as 'Пол', AVG (salary) as 'Средняя зарплата' FROM tblemployee
GROUP By gender

 * sqlite:///The_SQL_Server_Trail_Database.db
Done.

[('Female', 5000.0), ('Male', 9800.0)]

In [ ]:
%%sql SELECT gender,AVG(salary)
FROM tblemployee
GROUP BY gender

 * sqlite:///The_SQL_Server_Trail_Database.db
Done.

[('Female', 5000.0), ('Male', 9800.0)]

#### Показать среднюю зарплату по городам в порядке средней зарплаты от макс до мин

In [ ]:
%%sql
SELECT city as 'Города', ROUND (AVG(salary),2) as 'Средняя зарплата'
FROM tblemployee
GROUP BY city ORDER BY AVG(salary) DESC

 * sqlite:///The_SQL_Server_Trail_Database.db
Done.

[('Jerusalem', 9666.67), ('Tel-Aviv', 8000.0), ('Haifa', 4333.33)]

#### Показать максимальную и минимальную зарплату по полу

In [ ]:
%%sql
SELECT gender, max(salary) [Максимальная зарплата], min(salary)
from tblemployee
group by gender

 * sqlite:///The_SQL_Server_Trail_Database.db
Done.

[('Female', 10000, 1000), ('Male', 11000, 7000)]

#### Показать максимальную и минимальную зарплату по полу и городу

In [ ]:
%%sql
SELECT city, gender, MAX(salary) [Маким], MIN(salary) [Min Salary]
FROM tblemployee
GROUP BY gender, city

 * sqlite:///The_SQL_Server_Trail_Database.db
Done.

[('Haifa', 'Female', 2000, 1000),
 ('Jerusalem', 'Female', 10000, 8000),
 ('Tel-Aviv', 'Female', 4000, 4000),
 ('Haifa', 'Male', 10000, 10000),
 ('Jerusalem', 'Male', 11000, 11000),
 ('Tel-Aviv', 'Male', 11000, 7000)]

####  Показать сумарная зарплата по полу и городу

In [ ]:
%%sql
SELECT city, gender, SUM(salary) [Total Salary]
FROM tblemployee
GROUP BY gender, city

 * sqlite:///The_SQL_Server_Trail_Database.db
Done.

[('Haifa', 'Female', 3000),
 ('Jerusalem', 'Female', 18000),
 ('Tel-Aviv', 'Female', 4000),
 ('Haifa', 'Male', 10000),
 ('Jerusalem', 'Male', 11000),
 ('Tel-Aviv', 'Male', 28000)]

#### Подсчитайте общее количество сотрудников-женщин

In [ ]:
%%sql
SELECT gender, count(employeeID) as сотрудники
from tblemployee
where gender = 'Female'
group by gender

 * sqlite:///The_SQL_Server_Trail_Database.db
Done.

[('Female', 5)]

In [ ]:
%%sql SELECT gender, COUNT (*) AS EmployeeCount
FROM   tblemployee
GROUP BY gender
HAVING gender = 'Female'

 * sqlite:///The_SQL_Server_Trail_Database.db
Done.

[('Female', 5)]

####  Подсчитайте общее количество сотрудников в Тель-Авиве

In [ ]:
%%sql
SELECT city, COUNT(*) EmployeeCount
FROM   tblemployee
GROUP BY city
HAVING city = 'Tel-Aviv'

 * sqlite:///The_SQL_Server_Trail_Database.db
Done.

[('Tel-Aviv', 4)]

In [ ]:
%%sql
SELECT city, count(employeeID) as сотрудники
from tblemployee
where city = 'Tel-Aviv'
group by city

 * sqlite:///The_SQL_Server_Trail_Database.db
Done.

[('Tel-Aviv', 4)]

#### Показать сумарную зарплату по городам только для городов с общей зарплатой выше 20000 и отсортировать их от макс до мин.

In [ ]:
%%sql
SELECT city, SUM(salary) [Total Salary]
FROM tblemployee
GROUP BY city
HAVING SUM(salary) > 20000
ORDER BY [Total Salary]	DESC;

 * sqlite:///The_SQL_Server_Trail_Database.db
Done.

[('Tel-Aviv', 32000), ('Jerusalem', 29000)]

#### Показать сумарную зарплату только для мужчин, проживающих в Иерусалиме и Тель-Авиве.

In [ ]:
%%sql
SELECT gender, city , sum (salary)as 'Общая зп' FROM tblemployee
GROUP BY gender, city
HAVING gender='Male' and city in ('Tel-Aviv', 'Jerusalem')

 * sqlite:///The_SQL_Server_Trail_Database.db
Done.

[('Male', 'Jerusalem', 11000), ('Male', 'Tel-Aviv', 28000)]

## Join

In [ ]:
%%sql
CREATE TABLE tblCategory
(
CategoryID INT PRIMARY KEY NOT NULL,
CategoryName NVARCHAR (25)
) ;

INSERT INTO tblCategory VALUES
(1, 'Kitchen'),
(2, 'Living Room'),
(3, 'Bedroom'),
(4, 'Electrical appliance');

 * sqlite:///SQL_Server_Trail.db
Done.
4 rows affected.

[]

In [ ]:
%%sql
CREATE TABLE tblSubCategory
(
SubCategoryID INT,
SubCategoryName VARCHAR (30) NOT NULL,
CategoryID INT NOT NULL,
FOREIGN KEY (CategoryID) REFERENCES tblCategory (CategoryID),
PRIMARY KEY (SubCategoryID)
) ;

 * sqlite:///SQL_Server_Trail.db
Done.

[]

In [ ]:
%%sql
INSERT INTO tblSubCategory VALUES
(1,'Sink',1),
(2,'Tap',1),
(3,'Capboard',1),
(4,'Couch',2),
(5,'Dining table',2),
(6,'Easy Chair',2),
(7,'Bed',3),
(8,'Desk',3),
(9,'Mirror',3),
(10, 'Television',4),
(11, 'Washing Machine',4),
(12,'Electric Heater',4) ;

 * sqlite:///SQL_Server_Trail.db
12 rows affected.

[]

In [ ]:
%%sql
CREATE TABLE tblProducts
(
ProductID INTNOT NULL,
ProductName VARCHAR (45),
ProductPrice INT,
SubCategoryID INT,
FOREIGN KEY (SubCategoryID) REFERENCES tblSubCategory (SubCategoryID),
PRIMARY KEY(ProductID)
);

 * sqlite:///SQL_Server_Trail.db
Done.

[]

In [ ]:
%%sql
INSERT INTO tblProducts VALUES
(1,'Big Sink',5000,1),
(2,'Small Sink',3500,1),
(3,'Nirosta Sink',7500,1),
(4,'Big Tap',2000,2),
(5,'Small Tap',1000,2),
(6,'Standard Tap',500,2),
(7,'Big Capboard',4000,3),
(8,'Small Capboard',2500,3),
(9,'IKEA Capboard',2000,3),
(10,'Big Couch',4552,4),
(11,'Small Couch',2500,4),
(12,'Leather Couch',1500,4),
(13,'Round Table',8000,5),
(14, 'Rectangle Table',5000,5),
(15,'IKEA Table',3500,5),
(16,'American comfort',9000,6),
(17,'IKEA Single Chair',3500,6),
(18, 'Beytily Chair',4000,6),
(19,'King size bed',9500,7),
(20,'Queen size bed',11000,7),
(21, 'Single size bed',6000,7),
(22,'IKEA Desk',1500,8),
(23, 'Whole wood Desk',4500,8),
(24, 'Plywood Desk',1000,8),
(25,'Big Mirror',1500,9),
(26,'Small Mirror',500,9),
(27,'Personal Mirror',2500,9),
(28,'56 inch Samsung',5500,10),
(29,'32 inch HP',3500,10),
(30,'21 inch DELL',2700,10),
(31,'Bosh Machine',7000,11),
(32,'Samsung Machine',5000,11),
(33,'Makita Machine',4500,11),
(34,'Big Heater',500,12),
(35,'Small Heater',350,12),
(36,'Rocket Heater',200,12),
(37,'Coffee',5,null),
(38,'brown suger',0.5,null),
(39,'Tea',3,null),
(40, 'biscuit',6,null);

 * sqlite:///SQL_Server_Trail.db
40 rows affected.

[]

In [ ]:
%%sql
SELECT * FROM tblProducts

 * sqlite:///SQL_Server_Trail.db
Done.

[(1, 'Big Sink', 5000, 1),
 (2, 'Small Sink', 3500, 1),
 (3, 'Nirosta Sink', 7500, 1),
 (4, 'Big Tap', 2000, 2),
 (5, 'Small Tap', 1000, 2),
 (6, 'Standard Tap', 500, 2),
 (7, 'Big Capboard', 4000, 3),
 (8, 'Small Capboard', 2500, 3),
 (9, 'IKEA Capboard', 2000, 3),
 (10, 'Big Couch', 4552, 4),
 (11, 'Small Couch', 2500, 4),
 (12, 'Leather Couch', 1500, 4),
 (13, 'Round Table', 8000, 5),
 (14, 'Rectangle Table', 5000, 5),
 (15, 'IKEA Table', 3500, 5),
 (16, 'American comfort', 9000, 6),
 (17, 'IKEA Single Chair', 3500, 6),
 (18, 'Beytily Chair', 4000, 6),
 (19, 'King size bed', 9500, 7),
 (20, 'Queen size bed', 11000, 7),
 (21, 'Single size bed', 6000, 7),
 (22, 'IKEA Desk', 1500, 8),
 (23, 'Whole wood Desk', 4500, 8),
 (24, 'Plywood Desk', 1000, 8),
 (25, 'Big Mirror', 1500, 9),
 (26, 'Small Mirror', 500, 9),
 (27, 'Personal Mirror', 2500, 9),
 (28, '56 inch Samsung', 5500, 10),
 (29, '32 inch HP', 3500, 10),
 (30, '21 inch DELL', 2700, 10),
 (31, 'Bosh Machine', 7000, 11),
 (32, 'Samsung Machine', 5000, 11),
 (33, 'Makita Machine', 4500, 11),
 (34, 'Big Heater', 500, 12),
 (35, 'Small Heater', 350, 12),
 (36, 'Rocket Heater', 200, 12),
 (37, 'Coffee', 5, None),
 (38, 'brown suger', 0.5, None),
 (39, 'Tea', 3, None),
 (40, 'biscuit', 6, None)]

In [ ]:
%%sql
SELECT * FROM tblSubCategory

 * sqlite:///SQL_Server_Trail.db
Done.

[(1, 'Sink', 1),
 (2, 'Tap', 1),
 (3, 'Capboard', 1),
 (4, 'Couch', 2),
 (5, 'Dining table', 2),
 (6, 'Easy Chair', 2),
 (7, 'Bed', 3),
 (8, 'Desk', 3),
 (9, 'Mirror', 3),
 (10, 'Television', 4),
 (11, 'Washing Machine', 4),
 (12, 'Electric Heater', 4)]

In [ ]:
%%sql
SELECT * FROM tblCategory

 * sqlite:///SQL_Server_Trail.db
Done.

[(1, 'Kitchen'),
 (2, 'Living Room'),
 (3, 'Bedroom'),
 (4, 'Electrical appliance')]

#### Создайте внутреннее соединение между tblproducts и tblsubcategory. ( Из tblproducts показать productName и productPrice. Из tblsubcategory показать имя_подкатегории.)

In [ ]:
%%sql
SELECT      PR.ProductName, PR.ProductPrice, SC.SubCategoryName
FROM        tblProducts AS PR
INNER JOIN  tblbCategory AS SuSC
ON          PR.SubCategoryID = SC.SubCategoryID

 * sqlite:///SQL_Server_Trail.db
Done.

[('Big Sink', 5000, 'Sink'),
 ('Small Sink', 3500, 'Sink'),
 ('Nirosta Sink', 7500, 'Sink'),
 ('Big Tap', 2000, 'Tap'),
 ('Small Tap', 1000, 'Tap'),
 ('Standard Tap', 500, 'Tap'),
 ('Big Capboard', 4000, 'Capboard'),
 ('Small Capboard', 2500, 'Capboard'),
 ('IKEA Capboard', 2000, 'Capboard'),
 ('Big Couch', 4552, 'Couch'),
 ('Small Couch', 2500, 'Couch'),
 ('Leather Couch', 1500, 'Couch'),
 ('Round Table', 8000, 'Dining table'),
 ('Rectangle Table', 5000, 'Dining table'),
 ('IKEA Table', 3500, 'Dining table'),
 ('American comfort', 9000, 'Easy Chair'),
 ('IKEA Single Chair', 3500, 'Easy Chair'),
 ('Beytily Chair', 4000, 'Easy Chair'),
 ('King size bed', 9500, 'Bed'),
 ('Queen size bed', 11000, 'Bed'),
 ('Single size bed', 6000, 'Bed'),
 ('IKEA Desk', 1500, 'Desk'),
 ('Whole wood Desk', 4500, 'Desk'),
 ('Plywood Desk', 1000, 'Desk'),
 ('Big Mirror', 1500, 'Mirror'),
 ('Small Mirror', 500, 'Mirror'),
 ('Personal Mirror', 2500, 'Mirror'),
 ('56 inch Samsung', 5500, 'Television'),
 ('32 inch HP', 3500, 'Television'),
 ('21 inch DELL', 2700, 'Television'),
 ('Bosh Machine', 7000, 'Washing Machine'),
 ('Samsung Machine', 5000, 'Washing Machine'),
 ('Makita Machine', 4500, 'Washing Machine'),
 ('Big Heater', 500, 'Electric Heater'),
 ('Small Heater', 350, 'Electric Heater'),
 ('Rocket Heater', 200, 'Electric Heater')]

#### Создайте внутреннее соединение между tblproducts и tblcategory.<br>
-- из tblproducts показать productName и productPrice.<br>
-- из tblcategory показать имя_категории.

In [ ]:
%%sql
SELECT      PR.ProductName, PR.ProductPrice, SC.SubCategoryName, CT.CategoryName
FROM        tblProducts AS PR
INNER JOIN  tblSubCategory AS SC
ON          PR.SubCategoryID = SC.SubCategoryID
INNER JOIN  tblCategory AS CT
ON          SC.CategoryID = CT.CategoryID

 * sqlite:///SQL_Server_Trail.db
Done.

[('Big Sink', 5000, 'Sink', 'Kitchen'),
 ('Small Sink', 3500, 'Sink', 'Kitchen'),
 ('Nirosta Sink', 7500, 'Sink', 'Kitchen'),
 ('Big Tap', 2000, 'Tap', 'Kitchen'),
 ('Small Tap', 1000, 'Tap', 'Kitchen'),
 ('Standard Tap', 500, 'Tap', 'Kitchen'),
 ('Big Capboard', 4000, 'Capboard', 'Kitchen'),
 ('Small Capboard', 2500, 'Capboard', 'Kitchen'),
 ('IKEA Capboard', 2000, 'Capboard', 'Kitchen'),
 ('Big Couch', 4552, 'Couch', 'Living Room'),
 ('Small Couch', 2500, 'Couch', 'Living Room'),
 ('Leather Couch', 1500, 'Couch', 'Living Room'),
 ('Round Table', 8000, 'Dining table', 'Living Room'),
 ('Rectangle Table', 5000, 'Dining table', 'Living Room'),
 ('IKEA Table', 3500, 'Dining table', 'Living Room'),
 ('American comfort', 9000, 'Easy Chair', 'Living Room'),
 ('IKEA Single Chair', 3500, 'Easy Chair', 'Living Room'),
 ('Beytily Chair', 4000, 'Easy Chair', 'Living Room'),
 ('King size bed', 9500, 'Bed', 'Bedroom'),
 ('Queen size bed', 11000, 'Bed', 'Bedroom'),
 ('Single size bed', 6000, 'Bed', 'Bedroom'),
 ('IKEA Desk', 1500, 'Desk', 'Bedroom'),
 ('Whole wood Desk', 4500, 'Desk', 'Bedroom'),
 ('Plywood Desk', 1000, 'Desk', 'Bedroom'),
 ('Big Mirror', 1500, 'Mirror', 'Bedroom'),
 ('Small Mirror', 500, 'Mirror', 'Bedroom'),
 ('Personal Mirror', 2500, 'Mirror', 'Bedroom'),
 ('56 inch Samsung', 5500, 'Television', 'Electrical appliance'),
 ('32 inch HP', 3500, 'Television', 'Electrical appliance'),
 ('21 inch DELL', 2700, 'Television', 'Electrical appliance'),
 ('Bosh Machine', 7000, 'Washing Machine', 'Electrical appliance'),
 ('Samsung Machine', 5000, 'Washing Machine', 'Electrical appliance'),
 ('Makita Machine', 4500, 'Washing Machine', 'Electrical appliance'),
 ('Big Heater', 500, 'Electric Heater', 'Electrical appliance'),
 ('Small Heater', 350, 'Electric Heater', 'Electrical appliance'),
 ('Rocket Heater', 200, 'Electric Heater', 'Electrical appliance')]

#### ЛЕВОЕ соединение между tblproducts и tblcategory.<br>
- из tblproducts показать productName и productPrice.
- из tblcategory показать имя_категории.

In [ ]:
%%sql
SELECT      PR.ProductName, PR.ProductPrice, CT.CategoryName
FROM        tblProducts AS PR
LEFT JOIN   tblSubCategory AS SC
ON          PR.SubCategoryID = SC.SubCategoryID
LEFT JOIN   tblCategory AS CT
ON          SC.CategoryID = CT.CategoryID

 * sqlite:///SQL_Server_Trail.db
Done.

[('Big Sink', 5000, 'Kitchen'),
 ('Small Sink', 3500, 'Kitchen'),
 ('Nirosta Sink', 7500, 'Kitchen'),
 ('Big Tap', 2000, 'Kitchen'),
 ('Small Tap', 1000, 'Kitchen'),
 ('Standard Tap', 500, 'Kitchen'),
 ('Big Capboard', 4000, 'Kitchen'),
 ('Small Capboard', 2500, 'Kitchen'),
 ('IKEA Capboard', 2000, 'Kitchen'),
 ('Big Couch', 4552, 'Living Room'),
 ('Small Couch', 2500, 'Living Room'),
 ('Leather Couch', 1500, 'Living Room'),
 ('Round Table', 8000, 'Living Room'),
 ('Rectangle Table', 5000, 'Living Room'),
 ('IKEA Table', 3500, 'Living Room'),
 ('American comfort', 9000, 'Living Room'),
 ('IKEA Single Chair', 3500, 'Living Room'),
 ('Beytily Chair', 4000, 'Living Room'),
 ('King size bed', 9500, 'Bedroom'),
 ('Queen size bed', 11000, 'Bedroom'),
 ('Single size bed', 6000, 'Bedroom'),
 ('IKEA Desk', 1500, 'Bedroom'),
 ('Whole wood Desk', 4500, 'Bedroom'),
 ('Plywood Desk', 1000, 'Bedroom'),
 ('Big Mirror', 1500, 'Bedroom'),
 ('Small Mirror', 500, 'Bedroom'),
 ('Personal Mirror', 2500, 'Bedroom'),
 ('56 inch Samsung', 5500, 'Electrical appliance'),
 ('32 inch HP', 3500, 'Electrical appliance'),
 ('21 inch DELL', 2700, 'Electrical appliance'),
 ('Bosh Machine', 7000, 'Electrical appliance'),
 ('Samsung Machine', 5000, 'Electrical appliance'),
 ('Makita Machine', 4500, 'Electrical appliance'),
 ('Big Heater', 500, 'Electrical appliance'),
 ('Small Heater', 350, 'Electrical appliance'),
 ('Rocket Heater', 200, 'Electrical appliance'),
 ('Coffee', 5, None),
 ('brown suger', 0.5, None),
 ('Tea', 3, None),
 ('biscuit', 6, None)]

#### Показать сумарную цену продукта по названию категории в порядке от макс до мин.

In [ ]:
%%sql
SELECT      CT.CategoryName, SUM(PR.ProductPrice) AS [Total Price]
FROM        tblProducts AS PR
Left JOIN  tblSubCategory AS SC
ON          PR.SubCategoryID = SC.SubCategoryID
Left JOIN  tblCategory AS CT
ON          SC.CategoryID = CT.CategoryID
GROUP BY    CT.CategoryName
ORDER BY    SUM(PR.ProductPrice) DESC

UsageError: Cell magic `%%sql` not found.

-Вопрос 7 - показать название самого дорогого товара с подкатегорией и категорией.

In [ ]:
%%sql
SELECT      PR.ProductName, PR.ProductPrice, SC.SubCategoryName, CT.CategoryName
FROM        tblProducts AS PR
LEFT JOIN   tblSubCategory AS SC
ON          PR.SubCategoryID = SC.SubCategoryID
LEFT JOIN   tblCategory AS CT
ON          SC.CategoryID = CT.CategoryID
ORDER BY    PR.ProductPrice DESC
LIMIT 1

 * sqlite:///SQL_Server_Trail.db
Done.

[('Queen size bed', 11000, 'Bed', 'Bedroom')]

In [ ]:
%%sql
SELECT ProductName, MAX(ProductPrice), SubCategoryName, CategoryName
FROM tblProducts JOIN tblSubCategory
ON tblProducts.SubCategoryID = tblSubCategory.SubCategoryID
JOIN tblCategory
ON tblSubCategory.CategoryID = tblCategory.CategoryID

 * sqlite:///SQL_Server_Trail.db
Done.

[('Queen size bed', 11000, 'Bed', 'Bedroom')]

-- -Вопрос 8 - показать название самого дорогого продукта в категории name = 'kitchen'.
-- если у вас есть нулевые значения, не показывайте их!

In [ ]:
%%sql
SELECT      PR.ProductName, PR.ProductPrice, SC.SubCategoryName, CT.CategoryName
FROM        tblProducts AS PR
LEFT JOIN   tblSubCategory AS SC
ON          PR.SubCategoryID = SC.SubCategoryID
LEFT JOIN   tblCategory AS CT
ON          SC.CategoryID = CT.CategoryID
WHERE       CT.CategoryName = 'Kitchen'
ORDER BY    PR.ProductPrice DESC
LIMIT 1

 * sqlite:///SQL_Server_Trail.db
Done.

[('Nirosta Sink', 7500, 'Sink', 'Kitchen')]

Замена вопросов с пустыми значениями -- используйте таблицу tblKingOfAnimals

In [ ]:
%%sql
CREATE TABLE tblKingOfAnimals
(
AnimalID INT,
AnimalName NVARCHAR (30),
AnimalDominant INT,
PRIMARY KEY(AnimalID))

 * sqlite:///SQL_Server_Trail.db
Done.

[]

In [ ]:
%%sql
INSERT INTO tblKingOfAnimals VALUES
(1,'Snake',2),
(2,'Wolverine',5),
(3,'Wolf',6),
(4,'Eagle',5),
(5,'Hyena',6),
(6,'Lion',null)

 * sqlite:///SQL_Server_Trail.db
6 rows affected.

[]

In [ ]:
%%sql
select *
from tblKingOfAnimals

 * sqlite:///SQL_Server_Trail.db
Done.

[(1, 'Snake', 2),
 (2, 'Wolverine', 5),
 (3, 'Wolf', 6),
 (4, 'Eagle', 5),
 (5, 'Hyena', 6),
 (6, 'Lion', None)]


-- Вопрос 1 – создайте самообъединение, в котором отображаются два столбца – Имя животного и Имя доминирующего животного, чтобы для каждого животного вы видели, кто является его доминирующим животным. замените нулевое значение функцией «Царь животных» ИСПОЛЬЗОВАТЬ ISNULL.
-- Ответ:

In [ ]:
%%sql
SELECT      A.AnimalName, b.AnimalName

FROM        tblKingOfAnimals AS A
LEFT JOIN   tblKingOfAnimals AS B
ON          A.AnimalDominant = B.AnimalID

 * sqlite:///SQL_Server_Trail.db
Done.

[('Snake', 'Wolverine'),
 ('Wolverine', 'Hyena'),
 ('Wolf', 'Lion'),
 ('Eagle', 'Hyena'),
 ('Hyena', 'Lion'),
 ('Lion', None)]

-- Тема 06 - Математические функции -- используйте таблицу tblGenderMeasurements.
-- Вопрос 1. Создайте AVG для каждого из параметров: Возраст, Рост и Вес по полу. точно, увеличьте число AVG для каждого из параметров.
-- Ответ:

-- Вопрос 2. Создайте тот же запрос, но теперь укажите числа AVG.
-- Ответ:


-- Вопрос 3. Создайте тот же запрос, но теперь округляйте числа AVG.
-- Ответ:

In [ ]:
%%sql
CREATE TABLE tblGenderMeasurements
(
NumerID INT ,
Name    NVARCHAR (30),
Gender  NVARCHAR (20),
Age     DECIMAL (8,2),
Height  DECIMAL (8,2),
Weight  DECIMAL (8,2),
PRIMARY KEY(NumerID)
)

 * sqlite:///SQL_Server_Trail.db
Done.

[]

In [ ]:
%%sql
INSERT INTO tblGenderMeasurements VALUES
(1,'Tomer','Male',31.4,1.73,68.5),
(2,'Shai','Male',28.5,1.81,73.8),
(3,'Noam','Male',32.3,1.77,80.8),
(4,'Ben','Male',27.7,1.86,105.9),
(5,'Rita','Female',32.2,1.65,61.8),
(6,'Simha','Female',29.5,1.73,55.6),
(7,'Efrat','Female',35.2,1.70,59.4),
(8,'Miri','Female',26.4,1.78,63.8)

 * sqlite:///SQL_Server_Trail.db
8 rows affected.

[]

-- Вопрос 1. Создайте AVG для каждого из параметров: Возраст, Рост и Вес по полу. точно, увеличьте число AVG для каждого из параметров.
-- Ответ:

-- Вопрос 2. Создайте тот же запрос, но теперь укажите числа AVG.
-- Ответ:


-- Вопрос 3. Создайте тот же запрос, но теперь округляйте числа AVG.
-- Ответ:

In [ ]:
%%sql
SELECT AVG(Age), AVG(Height), AVG(Weight)
FROM tblGenderMeasurements
GROUP BY gender

 * sqlite:///SQL_Server_Trail.db
Done.

[(30.825000000000003, 1.715, 60.150000000000006),
 (29.974999999999998, 1.7925000000000002, 82.25)]

In [ ]:
%%sql
SELECT ROUND(AVG(Age),1) , ROUND(AVG(Height),1), ROUND(AVG(Weight),1)
FROM tblGenderMeasurements
GROUP BY gender

 * sqlite:///SQL_Server_Trail.db
Done.

[(30.8, 1.7, 60.2), (30.0, 1.8, 82.3)]

Показать текущую дату

In [ ]:
%%sql
SELECT date('now');

 * sqlite:///SQL_Server_Trail.db
Done.

[('2022-07-08',)]

In [ ]:
%%sql
SELECT strftime('%Y %m %d','now');

 * sqlite:///SQL_Server_Trail.db
Done.

[('2022 07 08',)]

In [ ]:
Показать текущую дату и время

In [ ]:
%%sql
select datetime('now','localtime')

 * sqlite:///SQL_Server_Trail.db
Done.

[('2022-07-08 17:34:34',)]

In [ ]:
cur = cnn.cursor()

In [ ]:
df = pd.read_sql_query("SELECT PR.ProductName, PR.ProductPrice, SC.SubCategoryName FROM  tblProducts AS PR INNER JOIN  tblSubCategory AS SC ON          PR.SubCategoryID = SC.SubCategoryID ", cnn)

In [ ]:
df

          ProductName  ProductPrice  SubCategoryName
0            Big Sink          5000             Sink
1          Small Sink          3500             Sink
2        Nirosta Sink          7500             Sink
3             Big Tap          2000              Tap
4           Small Tap          1000              Tap
5        Standard Tap           500              Tap
6        Big Capboard          4000         Capboard
7      Small Capboard          2500         Capboard
8       IKEA Capboard          2000         Capboard
9           Big Couch          4552            Couch
10        Small Couch          2500            Couch
11      Leather Couch          1500            Couch
12        Round Table          8000     Dining table
13    Rectangle Table          5000     Dining table
14         IKEA Table          3500     Dining table
15   American comfort          9000       Easy Chair
16  IKEA Single Chair          3500       Easy Chair
17      Beytily Chair          4000       Easy Chair
18      King size bed          9500              Bed
19     Queen size bed         11000              Bed
20    Single size bed          6000              Bed
21          IKEA Desk          1500             Desk
22    Whole wood Desk          4500             Desk
23       Plywood Desk          1000             Desk
24         Big Mirror          1500           Mirror
25       Small Mirror           500           Mirror
26    Personal Mirror          2500           Mirror
27    56 inch Samsung          5500       Television
28         32 inch HP          3500       Television
29       21 inch DELL          2700       Television
30       Bosh Machine          7000  Washing Machine
31    Samsung Machine          5000  Washing Machine
32     Makita Machine          4500  Washing Machine
33         Big Heater           500  Electric Heater
34       Small Heater           350  Electric Heater
35      Rocket Heater           200  Electric Heater

In [ ]:
df.to_excel('kk.xlsx')